{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "70f704eb",
   "metadata": {},
   "outputs": [],
   "source": [
    "import getpass\n",
    "import os\n",
    "\n",
    "# if \"OPENAI_API_KEY\" not in os.environ:\n",
    "#     #os.environ[\"OPENAI_API_KEY\"] = getpass.getpass(\"Enter your OpenAI API key: \")\n",
    "#     os.environ[\"OPENAI_API_KEY\"] = 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\n",
    "# # Uncomment the below to use LangSmith. Not required.\n",
    "# # os.environ[\"LANGSMITH_API_KEY\"] = getpass.getpass()\n",
    "# # os.environ[\"LANGSMITH_TRACING\"] = \"true\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "d07f19b3",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "from langchain.document_loaders import PyPDFLoader\n",
    "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
    "from langchain.schema import Document\n",
    "from langchain.prompts import PromptTemplate\n",
    "from langchain.vectorstores import Neo4jVector\n",
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain.embeddings import OpenAIEmbeddings\n",
    "from langchain.graphs import Neo4jGraph\n",
    "from langchain_experimental.graph_transformers.llm import LLMGraphTransformer\n",
    "\n",
    "\n",
    "from langchain.chains.graph_qa.cypher import GraphCypherQAChain\n",
    "import streamlit as st\n",
    "import tempfile\n",
    "from neo4j import GraphDatabase\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "5b34064f",
   "metadata": {},
   "outputs": [],
   "source": [
    "os.environ[\"NEO4J_URI\"] = \"bolt://localhost:7687\"\n",
    "os.environ[\"NEO4J_USERNAME\"] = \"neo4j\"\n",
    "os.environ[\"NEO4J_PASSWORD\"] = \"pass\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "5b4f1098",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['DiviSion'] name ['String'] True\n",
      "['Group'] name ['String'] True\n",
      "['Class'] name ['String'] True\n",
      "['Class'] Description ['String'] True\n",
      "['Subclass'] name ['String'] True\n",
      "['INDUSTRIES'] name ['String'] True\n",
      "['SECTION'] name ['String'] True\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/ck/gs22xnt513x04n1m13hg3w6h0000gr/T/ipykernel_27515/3183580265.py:11: DeprecationWarning: read_transaction has been renamed to execute_read\n",
      "  schema_info = session.read_transaction(get_schema)\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "uri      = \"bolt://localhost:7687\"\n",
    "auth     = (\"neo4j\", \"pass\")\n",
    "driver   = GraphDatabase.driver(uri, auth=auth)\n",
    "\n",
    "def get_schema(tx):\n",
    "    return list(tx.run(\"CALL db.schema.nodeTypeProperties()\"))\n",
    "\n",
    "with driver.session() as session:\n",
    "    schema_info = session.read_transaction(get_schema)\n",
    "    for record in schema_info:\n",
    "        print(record[\"nodeLabels\"], record[\"propertyName\"], record[\"propertyTypes\"], record[\"mandatory\"])\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "e9063ea5",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_neo4j import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "160b850e",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(\n",
    "    url=\"bolt://localhost:7687\",     # or \"neo4j://<HOST>:7687\"\n",
    "    username=\"neo4j\",\n",
    "    password=\"pass\",\n",
    "    database=\"neo4j\",                  # omit or change if using a different DB name\n",
    "    refresh_schema= True,\n",
    "    \n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "e1363011",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.refresh_schema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "7b2210fe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "SECTION {name: STRING}\n",
      "DiviSion {name: STRING}\n",
      "Group {name: STRING}\n",
      "Class {name: STRING, Description: STRING}\n",
      "Subclass {name: STRING}\n",
      "INDUSTRIES {name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:SECTION)-[:Division_under_section]->(:DiviSion)\n",
      "(:SECTION)-[:SECTION_OF_INDUSTRY]->(:INDUSTRIES)\n",
      "(:DiviSion)-[:Group]->(:Group)\n",
      "(:DiviSion)-[:Division_under_section]->(:SECTION)\n",
      "(:Group)-[:Group_to_class]->(:Class)\n",
      "(:Group)-[:Group]->(:DiviSion)\n",
      "(:Class)-[:Group_to_class]->(:Group)\n",
      "(:Class)-[:CLASS]->(:Subclass)\n",
      "(:Subclass)-[:CLASS]->(:Class)\n",
      "(:INDUSTRIES)-[:SECTION_OF_INDUSTRY]->(:SECTION)\n"
     ]
    }
   ],
   "source": [
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ab050cc",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "7dcd84eb",
   "metadata": {},
   "source": [
    "from langchain_neo4j import GraphCypherQAChain\n",
    "from langchain_ollama.chat_models import ChatOllama  # ← import Ollama’s Chat wrapper\n",
    "\n",
    "# point at whatever Ollama model you’ve pulled locally;\n",
    "# default base_url is http://localhost:11434\n",
    "llm = ChatOllama(\n",
    "    model=\"llama3\",       # replace with your model name, e.g. \"llama3.1\"\n",
    "    temperature=0,\n",
    "    # base_url=\"http://localhost:11434\",  # only if you’ve changed your Ollama host/port\n",
    ")\n",
    "\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    graph=graph,\n",
    "    llm=llm,\n",
    "    verbose=True,\n",
    "    allow_dangerous_requests=True\n",
    ")\n",
    "\n",
    "response = chain.invoke({\n",
    "    \"query\": \"how many subsection of industry are there\"\n",
    "})\n",
    "print(response)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cad947f8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (i:INDUSTRIES)<-[:SECTION_OF_INDUSTRY]-(s:SECTION)\n",
      "WHERE i.name = \"India\"\n",
      "RETURN DISTINCT s.name AS IndustrySections\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'query': 'I have a spare auto parts business which industries in india can i find clients in',\n",
       " 'result': \"I don't know the answer.\"}"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain_neo4j import GraphCypherQAChain\n",
    "from langchain_openai import ChatOpenAI\n",
    "\n",
    "llm = ChatOpenAI(model=\"gpt-4o\", temperature=1, openai_api_key=\"#insert key here\")\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    graph= graph, llm=llm, verbose=True, allow_dangerous_requests=True\n",
    ")\n",
    "response = chain.invoke({\"query\": \"I have a spare auto parts business which industries in india can i find clients in\"})\n",
    "response"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "tfenv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.21"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
